# ExtraPumpSet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..ExtraPumpSet Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
More than one parallel pump set defined for the same loop. Verify the flow distribution and delete the extra set, if desired.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ExtraPumpSet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExtraPumpSet As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ExtraPumpSet {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace